<?php

return [

    /*
    |--------------------------------------------------------------------------
    | All dropdown options
    |--------------------------------------------------------------------------
    |
    | Put dropdowns and their selections here
    |
    |
    */

    'yes_or_no' => [
        '否',
        '是',
    ],

    'has_or_not' => [
        '無',
        '有',
    ],

    'can_or_not' => [
        '不可',
        '可',
    ],

    'documents' => [
        'third_party_file' => '第三方代收文件',
        'original_file' => '合約原檔',
        'carrier_file' => '發票載具',
        'picture' => '相關照片'
    ],

    'cities' => [
        '臺北市' => [ '中正區', '大同區', '中山區', '萬華區', '信義區', '松山區', '大安區', '南港區', '北投區', '內湖區', '士林區', '文山區', ],
        '新北市' => [ '板橋區', '新莊區', '泰山區', '林口區', '淡水區', '金山區', '八里區', '萬里區', '石門區', '三芝區', '瑞芳區', '汐止區', '平溪區', '貢寮區', '雙溪區', '深坑區', '石碇區', '新店區', '坪林區', '烏來區', '中和區', '永和區', '土城區', '三峽區', '樹林區', '鶯歌區', '三重區', '蘆洲區', '五股區', ],
        '基隆市' => [ '仁愛區', '中正區', '信義區', '中山區', '安樂區', '暖暖區', '七堵區', ],
        '桃園市' => [ '桃園區', '中壢區', '平鎮區', '八德區', '楊梅區', '蘆竹區', '龜山區', '龍潭區', '大溪區', '大園區', '觀音區', '新屋區', '復興區', ],
        '新竹縣' => [ '竹北市', '竹東鎮', '新埔鎮', '關西鎮', '峨眉鄉', '寶山鄉', '北埔鄉', '橫山鄉', '芎林鄉', '湖口鄉', '新豐鄉', '尖石鄉', '五峰鄉', ],
        '新竹市' => [ '東區', '北區', '香山區', ],
        '苗栗縣' => [ '苗栗市', '通霄鎮', '苑裡鎮', '竹南鎮', '頭份鎮', '後龍鎮', '卓蘭鎮', '西湖鄉', '頭屋鄉', '公館鄉', '銅鑼鄉', '三義鄉', '造橋鄉', '三灣鄉', '南庄鄉', '大湖鄉', '獅潭鄉', '泰安鄉', ],
        '臺中市' => [ '中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區', '大里區', '霧峰區', '烏日區', '豐原區', '后里區', '東勢區', '石岡區', '新社區', '和平區', '神岡區', '潭子區', '大雅區', '大肚區', '龍井區', '沙鹿區', '梧棲區', '清水區', '大甲區', '外埔區', '大安區', ],
        '南投縣' => [ '南投市', '埔里鎮', '草屯鎮', '竹山鎮', '集集鎮', '名間鄉', '鹿谷鄉', '中寮鄉', '魚池鄉', '國姓鄉', '水里鄉', '信義鄉', '仁愛鄉', ],
        '彰化縣' => [ '彰化市', '員林鎮', '和美鎮', '鹿港鎮', '溪湖鎮', '二林鎮', '田中鎮', '北斗鎮', '花壇鄉', '芬園鄉', '大村鄉', '永靖鄉', '伸港鄉', '線西鄉', '福興鄉', '秀水鄉', '埔心鄉', '埔鹽鄉', '大城鄉', '芳苑鄉', '竹塘鄉', '社頭鄉', '二水鄉', '田尾鄉', '埤頭鄉', '溪州鄉', ],
        '雲林縣' => [ '斗六市', '斗南鎮', '虎尾鎮', '西螺鎮', '土庫鎮', '北港鎮', '莿桐鄉', '林內鄉', '古坑鄉', '大埤鄉', '崙背鄉', '二崙鄉', '麥寮鄉', '臺西鄉', '東勢鄉', '褒忠鄉', '四湖鄉', '口湖鄉', '水林鄉', '元長鄉', ],
        '嘉義縣' => [ '太保市', '朴子市', '布袋鎮', '大林鎮', '民雄鄉', '溪口鄉', '新港鄉', '六腳鄉', '東石鄉', '義竹鄉', '鹿草鄉', '水上鄉', '中埔鄉', '竹崎鄉', '梅山鄉', '番路鄉', '大埔鄉', '阿里山鄉', ],
        '嘉義市' => [ '東區', '西區', ],
        '臺南市' => [ '中西區', '東區', ' 南區', '北區', '安平區', '安南區', '永康區', '歸仁區', '新化區', ' 左鎮區', '玉井區', '楠西區', '南化區', '仁德區', '關廟區', '龍崎區', '官田區', '麻豆區', '佳里區', '西港區', '七股區', '將軍區', '學甲區', '北門區', '新營區', '後壁區', '白河區', ' 東山區', '六甲區', '下營區', '柳營區', '鹽水區', '善化區', '大內區', '山上區', '新市區', '安定區', ],
        '高雄市' => [ '楠梓區', '左營區', '鼓山區', '三民區', '鹽埕區', '前金區', '新興區', '苓雅區', '前鎮區', '小港區', '旗津區', '鳳山區', '大寮區', '鳥松區', '林園區', '仁武區', '大樹區', '大社區', '岡山區', '路竹區', '橋頭區', '梓官區', '彌陀區', '永安區', '燕巢區', '田寮區', '阿蓮區', '茄萣區', '湖內區', '旗山區', '美濃區', '內門區', '杉林區', '甲仙區', '六龜區', '茂林區', '桃源區', '那瑪夏區', ],
        '屏東縣' => [ '屏東市', '潮州鎮', '東港鎮', '恆春鎮', '萬丹鄉', '長治鄉', '麟洛鄉', '九如鄉', '里港鄉', '鹽埔鄉', '高樹鄉', '萬巒鄉', '內埔鄉', '竹田鄉', '新埤鄉', '枋寮鄉', '新園鄉', '崁頂鄉', '林邊鄉', '南州鄉', '佳冬鄉', '琉球鄉', '車城鄉', '滿州鄉', '枋山鄉', '霧台鄉', '瑪家鄉', '泰武鄉', '來義鄉', '春日鄉', '獅子鄉', '牡丹鄉', '三地門鄉', ],
        '宜蘭縣' => [ '宜蘭市', '羅東鎮', '蘇澳鎮', '頭城鎮', '礁溪鄉', '壯圍鄉', '員山鄉', '冬山鄉', '五結鄉', '三星鄉', '大同鄉', '南澳鄉', ],
        '花蓮縣' => [ '花蓮市', '鳳林鎮', '玉里鎮', '新城鄉', '吉安鄉', '壽豐鄉', '秀林鄉', '光復鄉', '豐濱鄉', '瑞穗鄉', '萬榮鄉', '富里鄉', '卓溪鄉', ],
        '臺東縣' => [ '臺東市', '成功鎮', '關山鎮', '長濱鄉', '海端鄉', '池上鄉', '東河鄉', '鹿野鄉', '延平鄉', '卑南鄉', '金峰鄉', '大武鄉', '達仁鄉', '綠島鄉', '蘭嶼鄉', '太麻里鄉', ],
        '澎湖縣' => [ '馬公市', '湖西鄉', '白沙鄉', '西嶼鄉', '望安鄉', '七美鄉', ],
        '金門縣' => [ '金城鎮', '金湖鎮', '金沙鎮', '金寧鄉', '烈嶼鄉', '烏坵鄉', ],
        '連江縣' => [ '南竿鄉', '北竿鄉', '莒光鄉', '東引鄉', ],
    ],

    'buildings' => [
        'building_type' => [
            '公寓',
            '公寓有電梯',
            '別墅',
            '待查',
            '透天',
            '頂加',
            '華廈',
            '電梯大樓',
            '電梯公寓',
        ],
        'legal_usage' => [
            '住宅',
            '店面',
            '廣告外牆',
        ],
        'payment_methods' => [
            '業主自付',
            '房客自付',
            '公司代繳',
            '業主代繳',
        ],
    ],

    'rooms' => [
        'room_status' => [
            '未出租',
            '已出租',
            '業者自管',
            '空屋清潔',
            '空屋維修',
            '家具電進場中',
        ],
        'room_layout' => [
            '雅房',
            '半套式雅房',
            '隔間套房',
            '獨立套房',
            '整層住家',
        ],
        'management_fee_mode' => [
            '比例',
            '固定',
        ],
    ],

    'tenant_contract' => [
        'car_parking_type' => [
            '機械式',
            '平面式',
        ],
        'electricity_payment_method' => [
            '儲值電表',
            '自行帳單繳付',
            '公司代付',
        ],
        'electricity_calculate_method' => [
            '固定',
            '手動',
        ],
        'invoice_collection_method' => [
            '載具',
            '親領',
        ],
    ],

    'key_requests' => [
        'status' => [
            '預約中',
            '持有中',
            '已歸還',
        ],
    ],

    'debt_collections' => [
        'status' => [
            '催收中',
            '已結案',
        ],
    ],

    'maintenance' => [
        'status' => [
            '待處理',
            '聯繫中',
            '已派工',
            '請款中',
            '案件完成',
            '已取消',
        ],
        'incident_type' => [
            '清潔',
            '維修',
        ],
        'work_type' => [
            '水電',
            '油漆',
            '木工',
            '冷氣',
            '漏水',
            '門窗',
            '壁紙',
            '網路',
            '家電',
            '清潔',
            '其它',
        ]
    ],

    'landlord_contracts' => [
        'commission_type' => [
            '包租',
            '代管',
        ],
        'rent_collection_frequency' => [
            '年',
            '月',
        ],
        'invoice_collection_method' => [
            '載具',
            '寄送',
        ],
        'is_notarized' => [
            '否',
            '是',
            '另議',
        ],
        'gender_limit' => [
            '不限',
            '男性',
            '女性',
        ],
    ],

    'shareholders' => [
        'transfer_from' => [
            '兆居',
            '兆基',
        ],
        'distribution_method' => [
            '固定',
            '浮動',
        ],
    ],

    'tenant_payments' => [
        'subject' => [
            '履約保證金',
            '更改繳款日租金',
            '仲介費',
            '顧問費',
            '管理費',
            '清潔費',
            '清潔費(公司)',
            '瓦斯費',
            '管理服務費',
            '滯納金',
            '轉房費',
            '換約費',
            '轉換承租人',
            '維修費',
            '車馬費',
            '放鳥費',
            '磁扣費',
            '水雜費',
            '垃圾費',
            '第四台',
            '鍋爐費'
        ],
        'period' => [
            '月',
            '季',
            '半年',
            '年',
            '次',
        ],
        'collected_by' => [
            '公司',
            '房東',
        ],
    ],

    'pay_logs' => [
        'payment_type' => [
            '租金雜費',
            '電費',
        ],
    ],

    'landlord_other_subjects' => [
        'income_or_expense' => [
            '收入',
            '支出',
        ],
    ],
    'invoice'=>[
        '發票張數',
        '發票日期',
        '品名序號',
        '發票品名',
        '數量',
        '單價',
        '課稅別',
        '稅率',
        '費用來源',
        '來源資料編號',
        '公司統編',
        '公司名稱',
        '物件代碼',
        '房號',
        '存入日期',
        '入帳日期',
        '共通載具',
        '發票號碼',
        '發票金額',
        '備註',
        '總額'
    ],
    'invoice_en' =>[
        'invoice_count',
        'invoice_date',
        'invoice_item_idx',
        'invoice_item_name',
        'quantity',
        'amount',
        'tax_type',
        'tax_rate',
        'data_table',
        'data_table_id',
        'company_number',
        'company_name',
        'building_code',
        'room_number',
        'deposit_date',
        'actual_deposit_date',
        'invoice_collection_number',
        'invoice_serial_number',
        'invoice_price',
        'comment',
        'subtotal'
    ],
    'receipt'=>[
        '物件代碼',
        '組別',
        '縣市',
        '區',
        '地址',
        '稅籍編號',
        '大房東',
        '應該給大房東租金',
        '可認列租金支出',
        '每月付款日',
        '支出年',
        '租金票到期日'
    ],
    'receipt_en' =>[
        'building_code',
        'group',
        'city',
        'district',
        'address',
        'tax_number',
        'landlord_name',
        'taxable_charter_fee',
        'actual_charter_fee',
        'rent_collection_time',
        'rent_collection_year',
        'commission_end_date'
    ]

];
